social-flow-backend/tools/load-testing/artillery/scenarios/soak_test.yml
config:
  target: "${ARTILLERY_TARGET}"
  processor: "../scripts/generate_jwt.js"
  phases:
    - duration: 3600
      arrivalRate: 50
      rampTo: 200

scenarios:
  - name: "soak"
    flow:
      - function: "setupAuth"
      - get:
          url: "/health"
      - loop:
          count: 100
          steps:
            - get:
                url: "/v1/explore?page={{ $randomInt(1,50) }}&limit=20"
            - think: 0.2