social-flow-backend/tools/load-testing/artillery/scenarios/user_journey.yml
config:
  target: "${ARTILLERY_TARGET}"
  processor: "../scripts/generate_jwt.js"
  phases:
    - duration: 120
      arrivalRate: 5
      rampTo: 50

scenarios:
  - name: "user_journey"
    flow:
      - function: "setupAuth"
      - get:
          url: "/v1/explore"
          capture:
            - json: "$.items[0].id"
              as: "first_item_id"
      - loop:
          count: 3
          steps:
            - post:
                url: "/v1/items/{{ first_item_id }}/comments"
                json:
                  text: "Great post from load test"
            - think: 0.8
            - post:
                url: "/v1/items/{{ first_item_id }}/like"